'use client';


// Helper component for kana-kanji pair
const KanaKanjiPair = ({ kanji, kana }) => {
    return (
        <span className="flex flex-col items-center justify-center">
            <span className="text-[0.6em] mb-[-0.6em] font-bold">{kana}</span>
            <span>{kanji}</span>
        </span>
    );
};

export default function Page() {
    // const data = [
    //     {
    //         "jp": [["蝉", "せみ"], "の", ["声", "こえ"], "を", ["聞", "き"], "く", ["度", "たび"], "に", " ", ["目", "め"], "に", ["浮", "う"], "かぶ", ["九十九里", "くじゅうくり"], ["浜", "はま"]],
    //         "zh": "只要一聽到蟬鳴 便會想起九十九里濱"
    //     },
    //     {
    //         "jp": [["皺々", "しわしわ"], "の", ["祖母", "そぼ"], "の", ["手", "て"], "を", ["離", "はな"], "れ", ["独", "ひと"], "りで", ["訪", "おとず"], "れた", ["歓楽街", "かんらくがい"]],
    //         "zh": "放開祖母滿是皺紋的雙手 獨自探訪的歡樂街"
    //     },
    //     {
    //         "jp": [["ママ", "まま"], "は", ["此処", "ここ"], "の", ["女王様", "じょおうさま"], " ", ["生", "い"], "き", ["写", "うつ"], "しの", ["様", "よう"], "なあたし"],
    //         "zh": "媽媽是這裏的女王 活生生我就是翻版"
    //     },
    //     {
    //         "jp": [["誰", "だれ"], "しもが", ["手", "て"], "を", ["伸", "の"], "べて", ["子供", "こども"], "ながらに", ["魅", "み"], "せられた", ["歓楽街", "かんらくがい"]],
    //         "zh": "每個人都伸出手來 雖然還小卻已深深迷戀的歡樂街"
    //     },
    //     {
    //         "jp": [["十", "じゅう"], ["五", "ご"], "に", ["成", "な"], "ったあたしを", ["置", "お"], "いて", ["女王", "じょおう"], "は", ["消", "き"], "えた"],
    //         "zh": "拋棄十五歲的我 女王銷聲匿跡"
    //     },
    //     {
    //         "jp": [["毎週", "まいしゅう"], ["金曜日", "きんようび"], "に", ["来", "き"], "ていた", ["男", "おとこ"], "と", ["暮", "く"], "らすのだろう"],
    //         "zh": "應該是跟每個星期五來的男人去生活了吧"
    //     },
    //     {
    //         "jp": [["一度", "いちど"], ["栄", "さか"], "えし", ["者", "もの"], "でも", ["必", "かなら"], "ずや", ["衰", "おとろ"], "えゆく"],
    //         "zh": "盛者必衰"
    //     },
    //     {
    //         "jp": ["その", ["意味", "いみ"], "を", ["知", "し"], "る", ["時", "とき"], "を", ["迎", "むか"], "え", ["足", "あし"], "を", ["踏", "ふ"], "み", ["入", "い"], "れたは", ["歓楽街", "かんらくがい"]],
    //         "zh": "領悟這個道理卻一腳踏進的歡樂街"
    //     },
    //     {
    //         "jp": [["消", "き"], "えて", ["行", "い"], "った", ["女", "おんな"], "を", ["憎", "にく"], "めど", ["夏", "なつ"], "は", ["今", "いま"]],
    //         "zh": "雖然怨恨失去蹤影的女人但小夏我現在"
    //     },
    //     {
    //         "jp": [["女王", "じょおう"], "と", ["云", "い"], "う", ["肩書", "かたが"], "きを", ["誇", "ほこ"], "らしげに", ["掲", "かか"], "げる"],
    //         "zh": "卻光榮的頂著女王的頭銜"
    //     },
    //     {
    //         "jp": [["女","おんな"], "に", ["成", "な"], "ったあたしが", ["売", "う"], "るのは", ["自分", "じぶん"], "だけで"],
    //         "zh": "成為女人的我賣的只有自己"
    //     },
    //     {
    //         "jp": [["同情", "どうじょう"], "を", ["欲", "ほっ"], "した", ["時", "とき"], "に", ["全", "すべ"], "てを", ["失", "うしな"], "うだろう"],
    //         "zh": "也許當我需要同情時就會失去一切吧"
    //     },
    //     {
    //         "jp": ["JR", ["新宿駅", "しんじゅくえき"], "の", ["東口", "ひがしぐち"], "を", ["出", "で"], "たら"],
    //         "zh": "走出JR新宿東出口"
    //     },
    //     {
    //         "jp": [["其処", "そこ"], "はあたしの", ["庭", "にわ"], " ", ["大", "だい"], ["遊戯場", "ゆうぎば"], ["歌舞伎町", "かぶきちょう"]],
    //         "zh": "那裏就是我的庭園 大遊戲場歌舞伎町"
    //     },
    //     {
    //         "jp": [["今夜", "こんや"], "からは", ["此", "こ"], "の", ["町", "まち"], "で", " ", ["娘", "むすめ"], "のあたしが", ["女王", "じょおう"]],
    //         "zh": "今夜開始在這個城市女兒的我將成為女王"
    //     }
    // ];


    const data = [
        {
            "jp": [["夢", "ゆめ"], "ならばどれほどよかったでしょう"],
            "zh": "如果是場夢該有多好"
        },
        {
            "jp": [["未","いま"], "だにあなたのことを", ["夢", "ゆめ"], "にみる"],
            "zh": "至今仍會不時夢見你"
        },
        {
            "jp": [["忘", "わす"], "れた", ["物", "もの"], "を", ["取", "と"], "りに", ["帰", "かえ"], "るように"],
            "zh": "就像要取回遺忘的東西"
        },
        {
            "jp": [["古", "ふる"], "びた", ["思", "おも"], "い", ["出", "で"], "の", ["埃", "ほこり"], "を", ["払", "はら"], "う"],
            "zh": "將陳舊回憶上的灰塵拂去"
        },
        {
            "jp": [["戻", "もど"], "らない", ["幸", "しあわ"], "せがあることを"],
            "zh": "有些幸福一去不復返"
        },
        {
            "jp": [["最後","さいご"], "にあなたが", ["教", "おし"], "えてくれた"],
            "zh": "這是最後你教會我的"
        },
        {
            "jp": [["言", "い"], "えずに", ["隠", "かく"], "してた", ["昏", "くら"], "い", ["過去", "かこ"], "も"],
            "zh": "隱藏起來沒說出口的晦暗過去"
        },
        {
            "jp": ["あなたがいなきゃ", ["永遠", "えいえん"], "に", ["昏", "くら"], "いまま"],
            "zh": "沒有了你也將永遠黑暗"
        },
        {
            "jp": ["きっともうこれ", ["以上", "いじょう"], "に", ["傷", "きず"], "つくことなど"],
            "zh": "我知道今後一定"
        },
        {
            "jp": ["ありはしないとわかっている"],
            "zh": "沒有比這更傷人的了"
        },
        {
            "jp": ["あの", ["日", "ひ"], "の", ["悲", "かな"], "しみさえ あの", ["日", "ひ"], "の", ["苦", "くる"], "しみさえ"],
            "zh": "那些日子的悲傷 那些日子的痛苦"
        },
        {
            "jp": ["そのすべてを", ["愛", "あい"], "してた あなたとともに"],
            "zh": "我全都深愛著 連你一起"
        },
        {
            "jp": [["胸", "むね"], "に", ["残", "のこ"], "り", ["離", "はな"], "れない", ["苦", "にが"], "い", ["レモン", "れもん"], "の", ["匂", "にお"], "い"],
            "zh": "殘留胸中消散不去 苦澀檸檬的氣味"
        },
        {
            "jp": [["雨", "あめ"], "が", ["降", "ふ"], "り", ["止", "や"], "むまでは", ["帰", "かえ"], "れない"],
            "zh": "在雨停歇前無法回去"
        },
        {
            "jp": [["今","いま"], "でもあなたはわたしの", ["光", "ひかり"]],
            "zh": "如今你依然是我的光"
        },
        {
            "jp": [["暗闇", "くらやみ"], "であなたの", ["背", "せ"], "をなぞった"],
            "zh": "曾在黑暗中描摹你的背"
        },
        {
            "jp": ["その", ["輪郭", "りんかく"], "を", ["鮮明", "せんめい"], "に", ["覚", "おぼ"], "えている"],
            "zh": "那輪廓我仍然記憶鮮明"
        },
        {
            "jp": [["受","う"], "け", ["止", "と"], "めきれないものと", ["出会", "であ"], "うたび"],
            "zh": "每當遇見無法接受的事物"
        },
        {
            "jp": [["溢","あふ"], "れてやまないのは", ["涙", "なみだ"], "だけ"],
            "zh": "便只有眼淚不住滿溢"
        },
        {
            "jp": [["何","なに"], "をしていたの", " ", ["何","なに"], "を", ["見", "み"], "ていたの"],
            "zh": "你做了些什麼 你看見了些什麼"
        },
        {
            "jp": ["わたしの", ["知", "し"], "らない", ["横顔", "よこがお"], "で"],
            "zh": "用我所不知道的另一種表情"
        },
        {
            "jp": ["どこかであなたが", ["今","いま"], "わたしと", ["同", "おな"], "じ", ["様", "よう"], "な"],
            "zh": "如果你此刻也在某處 和我一樣"
        },
        {
            "jp": [["涙", "なみだ"], "にくれ", ["淋", "さび"], "しさの", ["中", "なか"], "にいるなら"],
            "zh": "淚眼婆娑地 身陷寂寞之中"
        },
        {
            "jp": ["わたしのことなどどうか", ["忘", "わす"], "れてください"],
            "zh": "有關我的一切 就請你忘記"
        },
        {
            "jp": ["そんなことを", ["心", "こころ"], "から", ["願", "ねが"], "うほどに"],
            "zh": "打從心底如此希望"
        },
        {
            "jp": [["今","いま"], "でもあなたはわたしの", ["光", "ひかり"]],
            "zh": "如今你依然是我的光"
        },
        {
            "jp": [["自分", "じぶん"], "が", ["思", "おも"], "うより", ["恋", "こい"], "をしていたあなたに"],
            "zh": "我比自己所想的更戀慕你"
        },
        {
            "jp": ["あれから", ["思", "おも"], "うように", ["息", "いき"], "ができない"],
            "zh": "自那刻起便無法如所想般順暢呼吸"
        },
        {
            "jp": ["あんなに", ["側", "そば"], "にいたのに まるで", ["嘘", "うそ"], "みたい"],
            "zh": "你曾如此近在身旁 好似騙局"
        },
        {
            "jp": ["とても", ["忘", "わす"], "れられない それだけが", ["確", "たし"], "か"],
            "zh": "卻只有忘不掉你 無庸置疑"
        },
        {
            "jp": ["あの", ["日", "ひ"], "の", ["悲", "かな"], "しみさえ あの", ["日", "ひ"], "の", ["苦", "くる"], "しみさえ"],
            "zh": "那些日子的悲傷 那些日子的痛苦"
        },
        {
            "jp": ["そのすべてを", ["愛", "あい"], "してた あなたとともに"],
            "zh": "我全都深愛著 連你一起"
        },
        {
            "jp": [["胸", "むね"], "に", ["残", "のこ"], "り", ["離", "はな"], "れない", ["苦", "にが"], "い", ["レモン", "れもん"], "の", ["匂", "にお"], "い"],
            "zh": "殘留胸中消散不去 苦澀檸檬的氣味"
        },
        {
            "jp": [["雨", "あめ"], "が", ["降", "ふ"], "り", ["止", "や"], "むまでは", ["帰", "かえ"], "れない"],
            "zh": "在雨停歇前無法回去"
        },
        {
            "jp": [["切","き"], "り", ["分", "わ"], "けた", ["果実", "かじつ"], "の", ["片方", "かたほう"], "の", ["様", "よう"], "に"],
            "zh": "就像果實切開的其中一半"
        },
        {
            "jp": [["今","いま"], "でもあなたはわたしの", ["光", "ひかり"]],
            "zh": "如今你依然是我的光"
        }
    ];

    return (
        <div className="w-full max-w-6xl mx-auto pb-10 px-4">
            <div className="mt-4 mb-20">
                <h1 className="text-xl font-extrabold tracking-tight text-center flex flex-row  items-center">
                    {
                        ["Lemon", "-", ["米津", "よねづ"], ["玄師", "けんし"]].map((text, textIndex) => {
                            if (typeof text === 'string') {
                                return (
                                    <span key={`text-${textIndex}`} className={`inline-block${text === " " ? " px-2" : ""}`}>{text}</span>
                                );
                            } else {
                                return (
                                    <KanaKanjiPair key={`pair-${textIndex}`} kanji={text[0]} kana={text[1]} />
                                );
                            }
                        })
                    }
                </h1>
                <h1 className="text-xl font-extrabold tracking-tight text-center flex flex-row  items-center">
                "Lemon - 米津玄師"
                </h1>
                <div className="mt-6">
                    {data.map((item, index) => (
                        <div key={`translation-${index}`} className="flex flex-col my-2">
                            <div className="flex flex-row space-x-1 items-center">
                                {item.jp.map((text, textIndex) => {
                                    if (typeof text === 'string') {
                                        return (
                                            <span key={`text-${textIndex}`} className={`inline-block${text === " " ? " px-2" : ""}`}>{text}</span>
                                        );
                                    } else {
                                        return (
                                            <KanaKanjiPair key={`pair-${textIndex}`} kanji={text[0]} kana={text[1]} />
                                        );
                                    }
                                })}
                            </div>
                            <div className="text-gray-400">{item.zh}</div>
                        </div>
                    ))}
                </div>
            </div>
        </div>
    );
}